# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'adobe-creative-cloud'
cask 'aerial'
cask 'alfred'
cask 'anydesk'
cask 'bartender'
cask 'caffeine'
cask 'chronos'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'istat-menus'
cask 'java'
cask 'keybase'
cask 'little-snitch'
cask 'logitech-options'
cask 'mailplane'
cask 'microsoft-excel'
cask 'microsoft-outlook'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'mysqlworkbench'
cask 'ngrok'
cask 'nvidia-geforce-now'
cask 'paw'
cask 'phpstorm'
cask 'querious'
cask 'screenflow'
cask 'skype'
cask 'slack'
cask 'sonos'
cask 'sourcetree'
cask 'spectacle'
cask 'steam'
cask 'sublime-text'
cask 'synology-drive'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
#cask 'font-lato'
#cask 'font-open-sans'
#cask 'font-roboto'
#cask 'font-roboto-condensed'
#cask 'font-source-code-pro-for-powerline'
#cask 'font-source-code-pro'
#cask 'font-source-sans-pro'
#cask 'font-source-serif-pro'

# Mac App Store
mas '1Password', id: 1333542190
#mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Medis', id: 1063631769
mas 'Microsoft Remote Desktop 10', id: 1295203466
mas 'Numbers', id: 409203825
mas 'Apple Remote Desktop', id: 409907375
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
